hybridPorousFoam-tutorials/Darcy_Flow_Cases/Buckley-Leverett/gravity_Driven_VanGenuchten/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8000;
        startFace       1999;
    }
    leftWall
    {
        type            patch;
        nFaces          1;
        startFace       9999;
    }
    rightWall
    {
        type            patch;
        nFaces          1;
        startFace       10000;
    }
)

// ************************************************************************* //
